[
{"Student_Details": []},
{"Student_Details": []},
{"Student_Details": []},
{"Student_Details": []},
{"Student_Details": []},
{"Student_Details": []},
{"Student_Details": ["\n        ", "\n          ", "\n      "]},
{"Student_Details": [" OurCS has a tradition of working closely  with industry and research groups to both understand critical gender issues in professional  settings, as well as exploring job opportunities for women researchers  in computing related domains.", "\n        ", "\n        ", " The School of Computer Science at Carnegie Mellon University  welcomes sponsors to join us in supporting OurCS for women  undergraduates in the United States and around the world. ", "\n        ", "\n        ", " Exclusive  sponsorship gives a single company or computing related domain full brand exposure for a single  offering of OurCS. This includes high-profile recognition on the OurCS  web site, and inclusion in CMU-based media articles, press releases and  all event-related announcements. Additionally, sponsors are asked to  recommend potential speakers and mentors for OurCS events.", "\n        ", "\n        ", " Co-sponsorships provide similar identity opportunities, only shared among two or more co-sponsors and providing around $25,000 each.", "\n        ", " \n        ", " We welcome gifts at any level from secondary sponsors and will provide online visibility and recognition for their contributions! ", "\n        ", "\n        ", " The two primary value propositions for sponsors are:  taking a  high-profile leadership position in the global effort to recognize and  encourage women in computer science; and two, direct connection to a  pool of top talent in the field, including access to student resumes (with their permission). For companies and research groups with strong STEM  priorities, this is an opportunity to have a measurable, long-term  impact on the field.", "\n        ", "\n        For more questions about sponsorship, please contact: "]},
{"Student_Details": []},
{"Student_Details": []}
]