[
{"Strong_Points": ["Raised company awareness:", "Focused interest in your opportunities: ", "Pinpoint your recruitment through student groups:", "custom communication plan", "one on one", "dedicated room", "student interest", "reception", "Elevate your brand", "Day in the Student Commons", "Go deeper", "Company Information Sessions", "interview rooms reserved", "Build relationships and trust", "30+ student groups"], "Details_InDepth": ["Right when your company needs it the most, computing talent is scarce. The good news is that the College of Computing at Georgia Tech can supply precisely the talent you need to fuel your company’s future. Our undergraduate programs are experiencing record enrollments, and that means a growing stream of new graduates from a school ranked No. 5 in 2016 by the ", ".", "The College’s Corporate Affiliates Program (CAP) offers advantages to help you improve your competitive position among recruiters. By partnering with us, you will strengthen and widen your recruiting pipeline through increased awareness among our students and young alumni. The Dean will, in turn, deploy your unrestricted partnership contributions to advance the College’s strategic priorities, thus sustaining our efforts to develop the computing talent that is in such high demand by industry leaders.", "Who were last year's CAP partners? Explore the amazing companies who have partnered with the College of Computing on our CAP Partners highlight page.", " Hold a Corporate Day in the Student Commons to engage with the hundreds of students passing through daily.", "Host a Corporate Information Session each semester in a reserved room with dinner provided for students and rooms provided for private interviews.", " Involve yourself with one or more of 30 student interest groups representing the kinds of extracurricular interests that so often launch careers. Present at group meetings and partner with potential employees. Only CAP partners are offered the opportunity to sponsor student organizations.", "Get visible through a ", " incorporating digital signage, internal and external posters, CoC-directed emails, event postings on the College website, job postings, and social media support for CAP-related events.", "Build on the excitement you have generated by reserving valuable “", "” time at the Fall and Spring Career Fairs with a ", " for your information sessions and interview space.", "Begin a community of ", " by engaging at a ", " for corporate partners at during the fall Career Fair.", " with activities and food at your company’s ", " each semester.", " with potential hires with ", " (dinner and a room) with ", " for you to follow up one on one with a prospect.", " by working with any of our ", " by financially sponsoring events like hackathons or travel scholarships for students to attend conferences like the Grace Hopper Celebration of Women in Computing or the Richard Tapia Celebration of Diversity in Computing.", "Are you ready to let CAP help you gain a competitive advantage? Gifts can be provided through your corporate recruiting budget, community outreach budget, or research budget. Let us help design your plan for awareness raising, involvement, and securing your talent requirements.", " ", "\nAssistant Director of Development", "\n404.385.5468", "\n"]}
]