[
{"headings": ["Engage and recruit top talent", "Conduct sponsored research", "Technology transfer", "Enhance workforce education", "Leverage affinity for Ohio State", "Shape future learning experiences"], "details": ["Internships, externships, co-ops, sponsored research and other co-curricular experiences — whatever your goal is, we are committed to connecting you with students and graduates engaged in solving problems. Through our extensive talent network in Columbus, the region and around the globe, you have access to a pipeline of talent.", "Industries consistently turn to Ohio State's research experts to help explore and investigate new frontiers, access state-of-the-art laboratories and apply groundbreaking research to real-world solutions. More than 1,400 businesses tap into Ohio State's network of resources, partners, alumni and university consortiums at our Columbus campus and around the region.", "Our faculty continually makes discoveries and innovates in fields such as manufacturing, logistics, international business and science and technology. Whether licensing a new technology to an existing enterprise or creating an entirely new venture, business plays a critical role in ", ". Ohio State’s interdisciplinary approach connects innovations with business growth.", "Fulfill your corporate training and continuing education needs with Ohio State as workforce demographics and technologies change. Whether those needs are met by a current program or one that is custom-designed, our top schools and scholars are eager to work with you.", "Leverage the loyalty of Ohio State through cooperative, longer-term relationships that are founded in creating a shared value between your organization and the university. ", "Interested in taking a more hands-on role in shaping experiential learning opportunities, capstone projects, mentoring programs or nurturing a greater impact through deeper involvement? We continuously look to push forward and create participatory partnerships that will inspire the next generation."]}
]