[
{"advisor_level": ["Benefits include all of the items listed above plus the following:", "Interview space in Lawson or Haas as available", "Class project opportunity in CS 307/407", "Invitation to attend fall CPP meeting in advisory capacity", "Class presentation in CS 391 (signup on first-come, first served basis, (", ")", "Company day (including use of video wall) and tech talk in ", " (no company days during February Industry Days)", "Reception/lunch with top students following fall CPP meeting"], "friend_level": ["Attendance at fall career fair and choice of ", " other recruitment activity, ", " a company day (including use of video wall) and tech talk (", ") ", " a class presentation in CS 391 (signup on first-come, first-served basis, so Friends may participate if space is available) ", "Direct contact with CS department", "Opportunity to participate in other recruiting activities such as February Industry Days, \"Purdue's For Me\" admission presentations, and Bridge Program", "Publicity in CS department (bulletin boards, website, video wall)", "Advertising of partner-sponsored events (company days, etc.)", "Posting of positions in weekly email to students", "Salary/placement data", "Assistance in developing strategy to attract candidates", "Link on CS website to corporate web page", "Opportunity to work with/support student organizations as desired", "Opportunity to support CS department with merit-based scholarships", "Invitation to spring awards banquet"], "details": ["The Corporate Partners Program (CPP) is designed to foster close communication and promote mutually beneficial relationships between select corporations and the Department of Computer Science. This cooperation provides members with increased visibility and communication, interaction with students who may become future employees, ", " who are experts in relevant technical fields, and executive involvement. Partnerships provide the Department of Computer Science diversification of funding sources and access to modern instrumentation, as well as professional resources in tune to marketplace needs. It is a true partnership, where both sides benefit.", "The CS Corporate Partners Program offers two levels of participation.", ": Annual contribution of $10,000", ": Annual contribution of $5,000", " ", " ", " ", "* Certain benefits are tiered and are first available to Advisor Partners, then to Friend Partners.", "Each corporate member is asked to appoint a working contact person. Membership thus ensures a personal communication link and offers individualized service to member companies. Advisor level members are eligible for representation at the fall Corporate Partners meeting. The annual meeting held each fall provides opportunities to participate in curriculum development and networking with students, faculty, and corporate peers."]}
]