[
{"headings": ["Job Announcements on Full-time Jobs Page"], "details": ["Your company's job announcements are posted on the\r\n", " page. You get to make\r\ntwo announcements \r\nannually\r\nin HTML, up to 500 words, along with the contact \r\ninformation for one person at your company, and a link back to a page on \r\nyour company's web site. \r\n\r\n"]},
{"headings": ["Internship and Job Emails to Undergraduate Students"], "details": ["For every internship and job posting,\r\nyou get to send one email to all or ", " students for immediate attention.\r\nYou can select students based on a combination of GPA and courses taken to ensure\r\nthat you reach the most appropriate students.\r\nThe email can be up to 100 words, in HTML, with one link to\r\na web page on your company's web site, and the contact information (email/phone)\r\nof one person at your company. In the email, we \r\nadd a link to your posting on the internships/jobs page.\r\n\r\n"]},
{"headings": ["Campus Events Emails to Undergraduate Students"], "details": ["For every campus event posting on the events page,\r\nyou get to send one email to all our students for immediate attention.\r\nThe email can be up to 100 words, in HTML, with one link to\r\na web page on your company's web site, and the contact information (email/phone)\r\nof one person at your company. In the email, we \r\nadd a link to your posting on the campus events page.\r\n\r\n"]},
{"headings": ["Facilitated Access to Student Communities"], "details": ["USACS (Undergraduate Student Alliance of Computer Scientists)\r\nand WCS (Women in Computer Science) are our primary CS student organizations.\r\nAs an associate member of the IAP, you get our help in setting\r\nup conversations with the USACS and WCS officers, as well as other influential\r\nmembers. You can get their valuable input about the interests and \r\naspirations of our Computer Science students, and the various events they\r\nhold to inform, educate and socialize.\r\n\r\n"]},
{"headings": ["Help in Organizing Information Sessions on Campus"], "details": ["We help you organize one of your information sessions on campus.\r\nWe work with you to to determine prospective dates and times when students \r\nare most likely to attend, directing your presentation so it resonates\r\nwith students, bring in representatives from the student communities USACS\r\nand WCS to give their input on what makes a presentation at\r\nRutgers successful.\r\n\r\n"]}
]