[
{"info": ["There are many ways to promote your organization and connect with Iowa engineering students aside from career fairs and interviews.  We find most companies tend to have the most success when they have a persistent presence on campus.  We'll work with your company to develop a targeted strategy around your recruiting needs. ", "Guest speakers from various fields are always welcome to present on campus as a way to educate students about the career paths available within your industry. Teach students what people love about working in your field and what students should do to become marketable candidates.  Bring in engineers to speak to students about tech-related topics and industry trends, informing them about the up-to-the-minute happenings of the tech world.", "We invite employers to meet with faculty and staff to learn about the Iowa engineering curriculum and how best to promote your organization to specific majors. These meetings also educate us about your organization and opportunities so that we can better advise students. Faculty are always interested in developing relationships with industry partners to collaborate on student projects and research interests.", "Student organizations often request industry representatives to speak to their groups. With ", " in the College of Engineering, we have a variety of industry specific, diversity, and professional organizations.  If you have an interest in a particular organization, you can contact them directly, or let us know and we can assist you in making the connection.", "Each year organizations act as corporate sponsors for some of our programs and events. Your organization’s name will be included in event advertising, and you will have the option to have representatives present at the event. Our 30 page ", " is another opportunity for you to promote your company to students.  Used extensively in one-on-one advising and class presentations, the manuals typically reach 70-80% of our students.", "Site visits allow companies to highlight and market your organization to Iowa engineering students.  During the visit, employers/alumni typically describe their organization, discuss various career opportunities and their recruiting processes, offer tours and allow exchanges of information between students and company employees.", "Both are a great opportunity for you to provide real job interview experience and feedback to our students while promoting your organization, increasing campus visibility, and cultivating potential future candidates. Employers can create mock interview requests through our ", " system."], "headings": ["Industry Presentations (Lunch & Learns/Tech Talks/Info Sessions/Departmental Seminars)", "Meetings with Faculty and Professional Development Staff", "Collaboration with Student Organizations", "Corporate Sponsorship of Programs and Events", "Employer Site Visits", "Mock Interviews/Resume Reviews"]}
]