[
{"comps": ["Access to Students", "Visibility", "Who should join?", "Sponsorship ", "Contribution", " ", " "], "bullets": ["One-stop-shopping to connect with CS and ECE students.", "A dedicated account manager to help you develop a custom strategy to maximize your sponsorship. ", "Participation in two Corporate Connection After Hours events (fall and spring) ", "Engineering Career Services (ECS) benefits, which includes posting of jobs and internships, résumé database access, and one table at the spring or fall ECS career fair. ", "The ability to target specific students for inclusion in your recruiting events.", "One \"Corporate Day\" per year or the equivalent in activities and services", "First consideration for involvement in and sponsorship of student events, activities, scholarships, and projects.", "Priority consideration for established lectures including Intro to CS, ECE Explorations, and the ECE Colloquium.", "Facilitated access to student groups and organizations.", "Priority in room and facility scheduling for additional recruitment events.", "No-fee info sessions and tech talks in the ECE Building and Siebel.", "Publication of company information and announcements in targeted email blasts sent to students.", "The opportunity to include information in weekly electronic newsletters directed at students, faculty, and staff of both departments.", "Acknowledgment of sponsorship status on The Corporate Connection page via logo, company profile, and link to career page", "A visual presence in select CS and ECE communications tools.", "Assistance in organizing campus visits.", "Opportunities to further increase student awareness of your company through tech talks and classroom appearances.", "Is      committed to recruiting at Illinois ", "Hires      or would like to hire ECE and/or CS students", "Is      looking for input into education and research direction", "Would      like a high level of service that is coordinated, efficient, and effective"], "details": ["Look at the benefits you’ll receive through the Corporate Connection. You’ll see why innovative companies look to the University of Illinois for top talent.", " provides a unique access point for interacting with CS and ECE at Illinois. Your company should join The Corporate Connection if it:", "All sponsorships support program activities, educational and outreach activities, student projects, student organizations, scholarships, and other investments to strengthen the infrastructure of the CS and ECE Departments.", "The annual sponsorship contribution is $20,000, and the sponsorship year runs from the beginning of August to end of the following July. Companies already investing in CS and/or ECE may qualify for a reduced sponsorship contribution. Startups and small businesses may also qualify. ", "\r\n          Your contribution will be receipted by the University of Illinois Foundation. Your receipt will reflect the fair market value of goods and services received in exchange for your sponsorship.", "\r\n  ", " for details.", "The Corporate Connection is a joint program of the Department of Computer Science and Department of Electrical and Computer Engineering at the University of Illinois", "\r\n© 2018, The Board of Trustees of the University of Illinois"]}
] 
