[
{"Univ_Benefits": ["The advantages to the University are also substantial. We can learn about current problems in industry. Students become acquainted with industrial needs. The co-op program and summer internships in local and national industry provide students with a complementary element to their education. The result of the interaction is greater excellence in both the research and teaching missions of the school.", " Contact us:", "\n      Undergraduate Advising: ugrad-advisor at cs.washington.edu", "\n      Media Inquiries: media at cs.washington.edu", "\n      Webmaster: support at cs.washington.edu", "\n    "], "General_Benefits": ["The program offers many benefits to business and industry. There is the opportunity to influence computing research and education and to participate in long-range technical assessments of problems and directions in the field. Contacts with prospective employees can be established easily; affiliates have early access to student resumes and student and faculty publications. Special seminars and short courses can be arranged. Faculty members are available for informal technical discussions and more formal presentations.", "Paul G. Allen School of Computer Science & Engineering", "\n                  University of Washington", "\n                  Box 352350", "\n                  185 E Stevens Way NE", "\n                  Seattle, WA 98195", "\n                  206.543.1695 VOICE", "\n                  ", "\n             "], "Benefits": ["attendance at an annual Industry Affiliates Program meeting that features research overviews by faculty, in-depth research presentations and demonstrations by students on current work, working sessions on common technical areas with both faculty and students, and opportunities to interview prospective employees;", "seminars by faculty members at the affiliate company's site (upon request);", "access to online resumes submitted by graduating students at all degree levels, as well as ability to post open positions on CSE's jobs board;", "announcement of interesting seminars and presentations;", "contact with technical and administrative representatives of other affiliate companies; and", "many opportunities for informal meetings."], "Details": ["\n                        ", "                        ", "                    ", "$250 for individual entrepreneurs or startups with 10 or fewer employees", "$500/year for startups and companies of fewer than 50 employees", "$2,500/year for those with between 50 and 150 employees", "$5,000/year for those with between 150 and 1000 employees", "$10,000/year for larger companies"], "Additional_Benefits/Meetings": ["Research overviews by faculty and updates on recent developments and research results within the department.", "Small focused sessions organized by research areas where students, faculty, and affiliates can interact in a workshop setting and discuss research areas in depth.", "Demonstrations of software and hardware systems developed by our research projects.", "One-on-one meetings with individual faculty and students to create and/or continue collaborations.", "Discussion of the educational mission of the department and the continuous changes and improvements made to the curriculum", "Interaction with other affiliate members.", "Opportunities to interview and discuss employment opportunities with our undergraduate and graduate students for both permanent and co-op/internship positions."]}
]